#тема_17-09-2025_Кортежи
#веди количества списка
#веди певый элемент, веди второй элемент
#посчитай все элементы
#избавиться не четные числа
#посчетам суммы веди с клавиатуры и когда ноль подсчет закончен

#Задание_1-------------------------------------------------------
'''
q = int(input("Введите количество элементов списка: "))
sp = []
for n in range(1, q + 1):
    num = int(input(f"Введите {n}-е число в список: "))
    sp.append(num)
total = sum(sp)
print("\nСписок чисел:", sp)
'''
#---------------------------------------------------------------
'''
q = int(input("Введите количество элементов списка: "))
sp = []
s = 0
for n in range(1, q + 1):
    num = int(input(f"Введите {n}-е число в список: "))
    sp.append(num)
    s += num
print("\nСписок чисел:", sp)
print("Сумма чисел:", s)
'''
#---------------------------------------------------------------
'''
q = int(input("Введите количество элементов списка: "))
sp = []
for n in range(1, q + 1):
    num = int(input(f"Введите {n}-е число в список: "))
    sp.append(num)
sp = [x for x in sp if x % 2 != 0]
s = sum(sp)
print("\nСписок чисел без чётных:", sp)
print("Сумма нечётных чисел:", s)
'''
#---------------------------------------------------------------
'''
q = int(input("Введите количество элементов списка: "))
sp = []
for n in range(1, q + 1):
    num = int(input(f"Введите {n}-е число в список: "))
    sp.append(num)
sp = [x for x in sp if x % 2 == 0]
s = sum(sp)
print("\nСписок чисел без нечётных (только чётные):", sp)
print("Сумма чётных чисел:", s)
'''
#---------------------------------------------------------------
'''
q = int(input("Введите количество элементов списка: "))
sp = []
for n in range(1, q + 1):
    num = int(input(f"Введите {n}-е число в список (0 — закончить ввод): "))
    if num == 0:
        break
    sp.append(num)
print("\nСписок чисел:", sp)
'''
#---------------------------------------------------------------
'''
sp = []
while True:
    num = int(input("Введите число (0 — закончить ввод): "))
    if num == 0:
        break
    sp.append(num)
total = sum(sp)
print("\nСписок чисел:", sp)
'''
#---------------------------------------------------------------
'''
sp = []
while True:
    num = int(input("Введите число (0 — закончить ввод): "))
    if num == 0:
        break
    sp.append(num)
total = sum(sp)
print("\nСписок чисел:", sp)
print("Сумма чисел:", total)
'''
#---------------------------------------------------------------