#Задание1
'''
p = input("ведите предложение: ")
i = len(p)
for p in range(16):
    if p(p) == " ":
        [a] = "_"
        print(p)
'''

#Задание2
----- #Вариант1
'''
string = input("ведите текст: ")
lenght = len(string)
for i in range(-10, lenght):
    sup_string2= string[i:]
    print(sup_string2)
'''
----- #Вариант2
'''
string = input("Введите текст: ")
while len(string) > 0:
    print(string)
    string = string[1:-1]
'''
#Задание3

s = int(input("нпиши текст: "))
